--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY jozef                   ▀▄ ▄▀ 
▀▄ ▄▀     BY jozef jone       (@jozef3)     ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY jozef                ▀▄ ▄▀   
▀▄ ▄▀       broadcast  : اوامر الطرد             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "اوامر الطرد" then
return [[🏆🏆  اوامر الطرد و المنع👌👇:
➖🔸➖🔹➖🔸➖🔹➖ـ
👡kick : لطرد العضو بلرد
--------------------------------------------------------------------------
⚡بلوك : لطرد العضر ب الرد
--------------------------------------------------------------------------
🚀حظر : لحظر المستخدم
--------------------------------------------------------------------------
🔙الغاء الحضر : لفك حضر المستخدم #ب اليوزر
--------------------------------------------------------------------------
💁منع+الكلمة : لحظر الكلمات في المجموعة
--------------------------------------------------------------------------
📴الغاء المنع +الكلمة : لفتح حظر الكلمة
--------------------------------------------------------------------------
📄قائمه المنع : لعرض الكلمات المحظورة
--------------------------------------------------------------------------
📛كتم + المعرف : لكتم المستخدم
--------------------------------------------------------------------------
📛كتم + المعرف : ل الغاء كتم المستخدم
--------------------------------------------------------------------------
📃المكتوميين : عرض المكتومين
--------------------------------------------------------------------------
🎲🎲🎲🎲🎲🎲🎲🎲🎲🎲🎲🎲🎲🎲🎲🎲
-----اوامر رفع 👇 :

👮رفع ادمن : ل رفع المستخدم ادمن
--------------------------------------------------------------------------
👨تنزيل ادمن : ل انزال رتبة الادمن
--------------------------------------------------------------------------
🚓الادمنيه : ل عرض قائمة الادمنز في الكروب
--------------------------------------------------------------------------
👊مغادره : للخروج من لمجموعه
🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮
#البوت شغال 24ساعة 🏪 لان
 سيرفر مدفوع vpn💳
يوكف فقط عندما المطورين يرفعون ملفات جديدة او تحديث 

 :للتواصل مع المطورين @jozefjonebot
__________________
🗯 - Dev - @jozef3
💭 - Dev - @lllrulll
end

if not is_momod(msg) then
return "مو شغلك و لا تبعبص بكيفك👌"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(اوامر الطرد)"
},
run = run 
}
end