--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY jozef jone              ▀▄ ▄▀ 
▀▄ ▄▀     BY jozef      (@jozef3)     ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY jozef             ▀▄ ▄▀   
▀▄ ▄▀       broadcast   اوامر اضافية     ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "اوامر اضافية" then
return [[
🏆🏆 - اوامر اضافية ( للتسلية)👑👑
💯💯💯💯💯💯💯💯💯💯💯💯💯

----اوامر ضافية: 🎩👇
👑مطور البوت : لمعرفه مطور البوت
--------------------------------------------------------------------------
📷imag: لتحويل الملصق الى صورة
--------------------------------------------------------------------------
stiker:لتحويل الصورة ل ملصق
--------------------------------------------------------------------------
🔖ايدي : لعرض ايدي المجموعه
--------------------------------------------------------------------------
👀ايدي ب الرد: ل عرض ايدي الشخص ب الرد
--------------------------------------------------------------------------
��معلوماتي :اضهار المعلومات الخاصه بك
--------------------------------------------------------------------------
🚨معلومات المجموعه : لاضهار معلومات المجموعه
--------------------------------------------------------------------------
🚓القوانين : لاضهار القوانين
--------------------------------------------------------------------------
📨insta+ يوزر : يستعمل لجلب معلومات حساب
--------------------------------------------------------------------------
📡الطقس : + البلد لمعرفه درجه الحرارة وغيرها
--------------------------------------------------------------------------
⛪الاذان :  لمعرفه اوقات صلاة 
--------------------------------------------------------------------------
󾓦 خريطه: +البلد لظهار الخرائط
--------------------------------------------------------------------------
📝زخرفه+ النص بالعربي : لزخرفه بالعربيه
--------------------------------------------------------------------------
📝زخرف+ النص باالانكلش: لزخرفه بالنكليزيه 
--------------------------------------------------------------------------
🎫اسمي : لظهار اسمك الحالي 
#فقط لمن يحفظ رقم البوت
--------------------------------------------------------------------------
🎦اسم الكروب : لظهار اسم الكروب بلفعل 
🎵🎵🎵🎵🎵🎵🎵🎵🎵🎵🎵🎵🎵🎵🎵🎵
#البوت شغال 24ساعة 🏪 لان
 سيرفر مدفوع vpn💳
يوكف فقط عندما المطورين يرفعون ملف او للتحديث 

للتواصل مع المطورين @jozefjonebot
__________________
🗯 - Dev - @lllrulll
🗯 - Dev - @jozef
- Dev - @ABIN_ALLAH
من فضلك ان تابع القناة  
https://telegram.me/joinchat/CLQoVT8ShWEflPtH2pxvLA
]]
end

if not is_momod(msg) then
return "مو شغلك ..لا تبعبص بكيفك✋👊"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(اوامر اضافية)"
},
run = run 
}
end