--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY jozef jone              ▀▄ ▄▀ 
▀▄ ▄▀     BY jozef      (@jozef3)     ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY jozef             ▀▄ ▄▀   
▀▄ ▄▀       broadcast  : مساعده الادمن       ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "اوامر الحماية" then
return [[
🏆🏆 - اوامر الحماية في الكروب👑👑
💯💯💯💯💯💯💯💯💯💯💯💯💯 👇

🔒قفل+الامر : ل غلق 
🔓فتح+الامر : للسماح 

🏢 الاضافه : لمنع الاضافة اشخاص من قبل الاعضاء --------------------------------------------------------------------------
🚧البوتات : لمنع اظافة البوتات في الكروب 
--------------------------------------------------------------------------
🀄المجموعه : لجعل المجموعة خاصة
--------------------------------------------------------------------------
📛 الدردشه : لغلق المحادثة في المجموعة و لا يسمح ب التكلم لاي عظو فقط الادمن و المدير
--------------------------------------------------------------------------
📷 الصور : لمنع الصور داخل المجموعة
--------------------------------------------------------------------------
🔔الصوت : لمنع البصمات داخل المجموعة
--------------------------------------------------------------------------
📹 الوسائط: لمنع /الصور /الفديوات /الروابط /الملصقاات
#ملاحظة عند استعمال امر (قفل الوسائط) الرجاء استعمال امر { lock fwd/ } لحماية اكثر
--------------------------------------------------------------------------
🎥 الفيديو : منع ارسال الفديوات في المجموعه
--------------------------------------------------------------------------
📌 الروابط :لقفل الروابط+ روابط التحويل . في المجموعة ّ
--------------------------------------------------------------------------
📇 التكرار : لقفل التكرار (السبام)* في المجموعة

#ملاحظة عند استعمال امر (قفل التكرار) الرجاء قم ب تعين التكرار قبل ذلك .. مثال .. < وضع التكرار 5 >
--------------------------------------------------------------------------
📜الملصقات : لمنع الملصقات في المجموعة
--------------------------------------------------------------------------
📱 الصور المتحركه : لمنع الفديوات ذات 4 ثواني والخ
--------------------------------------------------------------------------
📁 الفايلات : لمنع ارسال اي نوع من الفايلات داخل المجموعة
--------------------------------------------------------------------------
📅 الكلايش : لقفل الرسائل الطويلة في المجموعة
#ملاحظة عند استعمال امر (قفل الكلايش)
الرجاء الانتباه الى ان البوت لا يسمح للشخص ب ارسال رسالة تحتوي ع اكثر من 350 حرف 
و سوف يتم تنبه العظو مرتين و عند تكرار الامر يتم حظره من قبل البوت ..... *لغرض منع التفليش والخ
--------------------------------------------------------------------------
🔔 الاضافه الجماعيه : لمنع اضافة جماعية (الرتل) بواسطة الابتوب
--------------------------------------------------------------------------
📰 العربيه : لمنع التحدث ب اللغة العربية في المجموعة
--------------------------------------------------------------------------
🎉 #قفل الميديا : لمنع ارسال صور+فايلات+ملفات+ملصقات+فديوات+روابط/داخل المجموعة .. مع التحذير ...
#ملاحظة الرجاء استعمال الامر كامل ( #قفل الميديا)
--------------------------------------------------------------------------
🎭الجيوش :لمنع التكلم ب الجيوش (اسماء الجيوش) داخل المجموعة
--------------------------------------------------------------------------
#الرجاء استعمال الامر
قفل + الامر
فتح  للتحديث 
🏆🏆 - اوامر الحماية في الكروب👑👑
💯💯💯💯💯💯💯💯💯💯💯💯💯 👇

🔒قفل+الامر : ل غلق 
🔓فتح+الامر : للسماح 

🏢 الاضافه : لمنع الاضافة اشخاص من قبل الاعضاء --------------------------------------------------------------------------
🚧البوتات : لمنع اظافة البوتات في الكروب 
--------------------------------------------------------------------------
🀄المجموعه : لجعل المجموعة خاصة
--------------------------------------------------------------------------
📛 الدردشه : لغلق المحادثة في المجموعة و لا يسمح ب التكلم لاي عظو فقط الادمن و المدير
--------------------------------------------------------------------------
📷 الصور : لمنع الصور داخل المجموعة
--------------------------------------------------------------------------
🔔الصوت : لمنع البصمات داخل المجموعة
--------------------------------------------------------------------------
📹 الوسائط: لمنع /الصور /الفديوات /الروابط /الملصقاات
#ملاحظة عند استعمال امر (قفل الوسائط) الرجاء استعمال امر { lock fwd/ } لحماية اكثر
--------------------------------------------------------------------------
🎥 الفيديو : منع ارسال الفديوات في المجموعه
--------------------------------------------------------------------------
📌 الروابط :لقفل الروابط+ روابط التحويل . في المجموعة ّ
--------------------------------------------------------------------------
📇 التكرار : لقفل التكرار (السبام)* في المجموعة

#ملاحظة عند استعمال امر (قفل التكرار) الرجاء قم ب تعين التكرار قبل ذلك .. مثال .. < وضع التكرار 5 >
--------------------------------------------------------------------------
📜الملصقات : لمنع الملصقات في المجموعة
--------------------------------------------------------------------------
📱 الصور المتحركه : لمنع الفديوات ذات 4 ثواني والخ
--------------------------------------------------------------------------
📁 الفايلات : لمنع ارسال اي نوع من الفايلات داخل المجموعة
--------------------------------------------------------------------------
📅 الكلايش : لقفل الرسائل الطويلة في المجموعة
#ملاحظة عند استعمال امر (قفل الكلايش)
الرجاء الانتباه الى ان البوت لا يسمح للشخص ب ارسال رسالة تحتوي ع اكثر من 350 حرف 
و سوف يتم تنبه العظو مرتين و عند تكرار الامر يتم حظره من قبل البوت ..... *لغرض منع التفليش والخ
--------------------------------------------------------------------------
🔔 الاضافه الجماعيه : لمنع اضافة جماعية (الرتل) بواسطة الابتوب
--------------------------------------------------------------------------
📰 العربيه : لمنع التحدث ب اللغة العربية في المجموعة
--------------------------------------------------------------------------
🎉 #قفل الميديا : لمنع ارسال صور+فايلات+ملفات+ملصقات+فديوات+روابط/داخل المجموعة .. مع التحذير ...
#ملاحظة الرجاء استعمال الامر كامل ( #قفل الميديا)
--------------------------------------------------------------------------
🎭الجيوش :لمنع التكلم ب الجيوش (اسماء الجيوش) داخل المجموعة
--------------------------------------------------------------------------
#الرجاء استعمال الامر
قفل + الامر
فتح + الامر
للتواصل مع المطورين @jozefjonebot
__________________
🗯 - Dev - @lllfylll
🗯 - Dev - @jozef
-Dev - @ABiN_ALLAH
من فضلك ان تابع القناة  
https://telegram.me/joinchat/CLQoVT8ShWEflPtH2pxvLA
]]
end

if not is_momod(msg) then
return "مو شغلك ..لا تبعبص بكيفك✋👊"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(اوامر الحماية)"
},
run = run 
}
end