--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY jozef                   ▀▄ ▄▀ 
▀▄ ▄▀     BY jozef jone       (@jozef3)     ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY jozef                ▀▄ ▄▀   
▀▄ ▄▀       broadcast  : تحشيش          ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "تحشيش" then
return [[اوامر التحشيش
#ملاحظة هذه الاوامر لغرض التسلية و الظحك فقط الرجاء عدم الزعل او الانضغاط🐸🚬
🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮🎮
كل الاوامر تشتغل ب لرد 
سوي رد ع شخص و اكتب احد الاوامر و البوت ح يجاوبك و يجاوبة الي سويتلة الرد😂👇
1_بوسة
2_انطي عيدية
3_فوت صارح
4_شنو رائيك بي
5_شنو رائيك بيهة
6_اكتليا
7_دا يزحف
8_غازلة
9_دا يسوي
10_يغلط عليك
🎭🎭🎭🎭🎭🎭🎭🎭🎭🎭🎭🎭🎭
#ملاحظة لم يتم اظافة 3 اوامر اخرى ل اسباب🐸 خاف بنات و كذا و تعرف😂🚬
اذا ردت تعرفهن تعال ع بوت التواصل @jozefjonebot
#البوت شغال 24ساعة 🏪 لان
 سيرفر مدفوع vpn💳
يوكف فقط عندما المطورين يرفعون ملفات جديدة او تحديث 

 :للتواصل مع المطورين @jozefjonebot
__________________
🗯 - Dev - @jozef3
💭 - Dev - @lllfulll]]
end

if not is_momod(msg) then
return "مو شغلك و لا تبعبص بكيفك👌"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(تحشيش)"
},
run = run 
}
end