--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
do-- by @iq_100k
local function iq_100k(msg, matches)
if matches[1] == "الاوامر" then
local helps =  [[
⚡️ᗨ  <b> all help list    ᗨ⚡️

🔸➖➖➖➖➖➖➖🔹

🌟 م1 👮🏻 أُوُأُمہرُ أُلرُفَعً وُأُلحّضًرُ

🌟 م2 👮🏻 أُإوُأُإمہرُ أُإلضًبِطً

🌟 م3 👮🏻 آإوُآإمہڑ آإلבمہآإيًّـهہ

🌟 م4 👮🏻 أُإوُأُإمہرُ ضًبِطً أُإلمہيّدٍيّأُإ

🌟 م5 👮🏻 أُوُأُمہرُ ضًبِطً أُضًأُفَيّهہ

🌟 م6 👮🏻 لعًڑضً آإلعًآإب آإلبہوُت

🌟 م7 👮🏻 لعًڑضً آإوُآإمہڑ آإلڑدٍوُدٍ 

🌟 م المطور 👮🏻 للمطورين فقط

🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 

                          </b>
]]
reply_msg(msg.id, helps, ok_cb, false) 
end
if is_momod(msg) and matches[1]== 'م7' then
local g = [[
<b>
all replay menu 🚀
🔸➖➖➖➖➖➖➖🔹

🌝✋🏻 فتح الردود : لتشغيل الردود
🌝✋🏻 قفل الردود : لتعطيل الردود
🌝✋🏻 الردود : لعرض الردود المثبته
🌝✋🏻رد اضف  + الرد : لأضافه رد 
🌝✋🏻رد مسح  +الرد المراد مسحه
🌝✋🏻رد مسح الكل : لمسح الكل

🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 
                 </b>
]]
reply_msg(msg.id, g, ok_cb, false) 
end
if is_momod(msg) and matches[1]== 'م6' then
local ds = [[
<b>
the games 🚀
🔸➖➖➖➖➖➖➖🔹

🔷  1 : لعبه المحيبس 😻


😻✋🏻 بدء اللعبه : لبدء لعبه المحبس

😻✋🏻 انهاء لعبه : لغلق لعبه المحبس

🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 
          </b>
]]
reply_msg(msg.id, ds, ok_cb, false) 
end

if is_momod(msg) and matches[1]== 'م1' then
local a = [[
                    <b>
 promote and demote list 📍
🔸➖➖➖➖➖➖➖🔹

▪️ رفع ادمن : لرفع ادمن في البوت
▫️ رفع اداري : لرفع ادمن في المجموعه
▪️ تنزيل ادمن : لتنزيل ادمن من البوت
▫️ تنزيل اداري : لتنزيل ادمن من المجموعه
▪️ الادمنيه : لعرض قائمة الادمنيه
▫️ الاداريين : لعرض قائمة الاداريين

🔸➖➖➖➖➖➖➖🔹
📍💭 block and kick 🀄️

🔸 حظر : لحظر وطرد عضو من المجموعه 
🔹 الغاء الحظر : لالغاء الحظر عن عضو 
🔸 منع : لمنع كلمه داخل المجموعه
🔹 الغاء منع : لالغاء منع الكلمه  
🔸 كتم  : لكتم عضو بواسطة الرد
🔹 ايدي : لعرض ايدي المجموعه 
🔸 ايدي بالرد : لعرض ايدي العضو 
🔹 ايديي : لعرض ايديك

🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 
                     </b>
]]
reply_msg(msg.id, a, ok_cb, false) 
end

-- نهاية السته الاولئ
if is_momod(msg) and matches[1]== 'م2' then
local b = [[
🎭 <b> set settings list 🀄️
🔸➖➖➖➖➖➖➖🔹

🌇 ضع صوره :↜ لوضع صوره 
📝 ضع قوانين :↜ لوضع قوانين 
🏴 ضع معرف :↜ لوضع معرف 
📝 ضع وصف :↜ لوضع وصف  
🏴 ضع اسم :↜ لوضع اسم   
📛 ضـع رابط :↜ لوضع الرابط  
📛 الـرابـط :↜  لعرض الرابط  
📛 تغير الرابط :↜ لتغير الرابط
🔸➖➖➖➖➖➖➖🔹
🎭  gb settings list 🀄️

📌  القوانين : لعرض  القوانين 
📌   الادمنيه : لعرض  الادمنيه 
📌  الاداريين : لعرض  الاداريين 
📌   المكتومين :↜لعرض  المكتومين 
📌  المطور : لعرض معلومات المطور 
📌  معلوماتي :↜لعرض معلوماتك  
📌  الحمايه : لعرض اعدادات الحمايه
📌   الوسائط : لعرض اعدادات الميديا 
📌   المجموعه : لعرض المعلومات 
📌   الطقس + موقعك : لعرض الطقس 
📌   ترجمه + كلمه عربي : لتحويلها الى EN
📌   ملصق + رد للصوره : لتحويلها الى ملصق
🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 

                               </b>
]]
reply_msg(msg.id, b, ok_cb, false) 
end

-- نهايت السته الثانيه
if is_momod(msg) and matches[1]== 'م3' then
local c = [[
<b>
security list⚡️

🔸➖➖➖➖➖➖➖🔹

❗️ قفل ┇ فتح : الاضافه
❗️ قفل ┇ فتح :  الجماعيه
❗️ قفل ┇ فتح : الدردشه
❗️ قفل ┇ فتح : الملصقات
❗️ قفل ┇ فتح : الروابط
❗️ قفل ┇ فتح : اليوزر
❗️ قفل ┇ فتح : الردود
❗️ قفل ┇ فتح : الوسائط 
❗️ قفل ┇ فتح : البوتات
❗️ قفل ┇ فتح : الكلايش
❗️ قفل ┇ فتح : التكرار
❗️ قفل ┇ فتح :  التوجيه
❗️ قفل ┇ فتح : جهات الاتصال
❗️ قفل ┇ فتح : العربيه
❗️ قفل ┇ فتح : المجموعه 
❗️ قفل ┇ فتح : الــكـــل

🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 
    </b>
]]
reply_msg(msg.id, c, ok_cb, false) 
end

-- نهايت السته الثالثه
if is_momod(msg) and matches[1]== 'م4' then
local d = [[
<b>
media list 🀄️
🔸➖➖➖➖➖➖➖🔹

❗️ قفل ┇ فتح :  الــفيديو
❗️ قفل ┇ فتح : الـصـوت 
❗️ قفل ┇ فتح :  الـصــور 
❗️ قفل ┇ فتح :  الملصقات
❗️ قفل ┇ فتح :  المتحركه
❗️ قفل ┇ فتح :  الوسائط

🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 
     </b>
]]
reply_msg(msg.id, d, ok_cb, false) 
end

-- نهايت السته الرابعه
if is_momod(msg) and matches[1]== 'م5' then
local mor = [[
<b>
word list 💡

❄️ زخرفه + نص : للزخرفه العربيه
❄️ زخرف + text : للزخرفه الانكليزيه

🔸➖➖➖➖➖➖➖🔹
🌝 your info 🙊

⚜️ اسمي : لعرض اسمك 🎈
⚜️ معرفي : لعرض معرفك 🎈
⚜️ ايديي : لعرض ايديك 🎈
⚜️ رقمي : لعرض رقمك  🎈

🔸➖➖➖➖➖➖➖🔹
💠 اوامر التحشيش 😄

بوس + (نص)  🔺تحب + (نص) 
🔸 كول +(نص) 


🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 
                </b>
]]
reply_msg(msg.id, mor, ok_cb, false)
end

  if is_sudo(msg) and matches[1]== "م المطور" then
 local su = [[
<b>
⚜️🔸 sudo list 🔹⚜️

🔸➖➖➖➖➖➖➖🔹
📌 تفعيل  : لتفعيل البوت 
📌 تعطيل : لتعطيل البوت 
📌 اذاعه : لنشر كلمه 
📌 طرد البوت : لطرد البوت
📌 صنع مجموعه : لصنع مجموعه 
📌 سوبر : لجعل المجموعه خارقه
📌 مسح المعرف  : مسح معرف المجموعه
📌 مسح الادمنيه : لمسح الادمنيه 
📌 مسح الاداريين : لمسح الاداريين 
🔸➖➖➖➖➖➖➖🔹
🛠 تنشيط: لتنشيط سيرفر البوت
🛠 تحديث: لتحديث سيرفر البوت
🛠 اصلاح الاخطاء: لعمل رديس لسيرفر البوت

🔸➖➖➖➖➖➖➖🔹
🔸DEVPLOMER  iq_100k 
🔸channel_porgramer_2017
🔸SMILE BOT 🚩 
                      </b>
]]
reply_msg(msg.id, su, ok_cb, false)
end
  if not is_sudo(msg) and matches[1]== "م المطور" then
local su = "<b> for sudo only </b> 💡"
reply_msg(msg.id, e, ok_cb, false)
end
end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م1)$",
"^(م2)$",
"^(م3)$",
"^(م4)$",
"^(م5)$",
"^(م المطور)$",
"^(الاوامر)$", 
"^(م7)$",
"^(م6)$",



},
run = iq_100k 
}
end
-- by @iq_100k
--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
