--[[
# For More Information ....! 
# Developer : Aziz < @devss_bot >      #Dev
# our channel: @help_tele
]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "مساعدة" then
return [[جميع الاوامر تعمل بدون الاشارات [!#/]❌
بوت ديفل الاصلي ..اوامر مميزة .. حماية عالية... من اقوى بوتات التلي.... سيرفر مدفوع ف ما ياكف
الاوامر العربيه فقط
■ (اوامر الحماية) : لعرض اوامر حماية المجموعة
--------------------------------------------------------------------------
■ (اوامر الطرد)  : لعرض اوامر الطرد+الحظر+الكتم
--------------------------------------------------------------------------
■(اوامر المجموعة) :  لعرض اوامر  الرفع + المسح
--------------------------------------------------------------------------
(اوامر اضافية) : لعرض اوامر التسلية
--------------------------------------------------------------------------
(اوامر المطور) : لعرض اوامر المطورين فقط
--------------------------------------------------------------------------
(تحشيش) لعرض اوامر المزاح 
〰〰〰〰〰〰〰〰
الاوامر الانكلش فقط

■ (help me) : اوامر الرئيسية

■ (help admin)   اوامر الحماية  القفل+الفتح

■(help sudo) : اوامر المطورين
⭐ 🔻🔺🔻🔺🔻🔺للتوصيل🔻🔺🔻🔺🔻 ⭐
🚨 Dev - jozef3
🚨 Dev - @lllfylll
🚨 Dev - @ABIN_ALLAH
@jozefjonebot ◐ ♺

]]
end

if not is_momod(msg) then
return "مو شغلك  😎🖕🏿"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(مساعدة)"
},
run = run 
}
end