do 

function run (msg, matches) 

local reply_id = msg ['id'] 
if matches[1]==  'الاوامر'  then 
local wounds = [[ߑ˰ߏ젼b>Hello My Frend</b> 
ߙ°ߍà<b>Tere are [3] list to help..</b> 
<code> يوجد [3]قوائم للاوامر العربية </code> 
ا➖➖➖➖➖➖➖➖➖ 
<b>h1 __ </b> لعرض اوامر الرفع 
<b>h2 __ </b> لعرض اوامر الوضع 
<b>h3 __ </b> لعرض اوامر القفل 
<b>sudoar __ </b> لعرض اوامر  المطور 
<b>help_ </b> عرض الاوامر بللغة الانكليزية 
ا➖➖➖➖➖➖➖➖➖ 
߅ﯸϠDeveloper¦ @wounds1 
ا➖➖➖➖➖➖➖➖➖ 
]] 

reply_msg(reply_id, wounds, ok_cb, false) 
end 

local reply_id = msg ['id'] 
if matches[1]==  'h1' and is_momod(msg) then 
local help4 = [[ 
<b>Hello to the commands that to raise</b> 
ـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
ߔ蘧رفع ادمن :ߎ領ᙁع ادمن 
ߔ虆زل ادمن :ߑꙆزيل ادمن 
ߔ蘧لادمنة :✋ߏ�ادمنية 
ߔ蘧لمدير :ߛàالمدير 
ـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
ߔ蘷رد : ߚ تعمل بلرد ™ للطرد 
ߔ蘭ظر : ߚ`تعمل بلرد ™ للحظر 
ߔ蘧لغاء الحظر : ⛳️ للغاء الحظر 
ߔ虃تم : ߒ᠙ęØꙅ عضو 
ߔ蘧لغاء الكتم : ⏩ لرفع الكتم 
ߔ蘧يدي : ߆Ԡلعرض الايدي 
ߔ虅علومات : ߏ阹رض المعلومات 
ߔ虅سح : ߓ㠙Ř㘭 رسلة بلرد 
ߔ蘧لاعدادات : ߛ࠘阱ض الاعدادات  
ـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
߅ﯸϘ癄مطور _ @wounds1 
ـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
]] 
..'߆Ԡالمجموعة : '..msg.to.title..'\n' 
..'ߓŠالتاريخ : '.. os.date('!%A %B:%d:%Y\n', timestamp) 
reply_msg(reply_id, help4, ok_cb, false) 
end 
local reply_id = msg ['id'] 
if matches[1]== 'h1' and not is_momod(msg) then 
    local help = 'مشرفين فقط ߍ秠
    reply_msg(reply_id, help, ok_cb, false) 
    end 
local reply_id = msg ['id'] 
if matches[1]==  'h2' and is_momod(msg) then 
local zaza3 = [[ 
ߒᠼb>Hello in your orders Put</b> ߒ᠊ا_________________________ 
ߔ蘶ع ترحيب ➸ߑ˰ߏ완وضع ترحيب 
ߔ虅سح الترحيب ➸ ߌŘ㘭 الترحيب 
ߔ蘶ع اسم ➸ ߏ砙ęȘ昹 اسم 
ߔ蘶ع صورة ➸ ߃Ϡلوضع صورة 
ߔ蘶ع قوانين :➸ ߓ䠙ęȘ昹 قوانين 
ߔ蘶ع وصف ➸ ߚ لوضع وصف 
ߔ蘶ع التكرار ➸ ߌЬ لوضع حد للتكرار 
ߔ蘶ع رابط ➸ ☯ لوضع رابط 
ߔ蘵نع رابط ➸ ߏřĘ噆ع رابط 
ߔ蘧لرابط ➸ ߓ`لجلب الرابط 
ـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
ߔ虅نع +… ➸ ⛔️منع كلمة معينة 
ߔ蘧لغاء المنع ➸ ✅  الغاء منع كلمة 
ߔ虂ائمة المنع ➸ ߓݠقائمة الكلمات الممنوعة 
ߔ虂ائمة الكتم ➸ߔǘ阱ض المكتومين 
ߔ蘧لقوانين ➸ߚ昹رض القوانين 
ا_________________________ 
߅ﯸϠالمطور_ @wounds1 
lـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
]] 
..'〰 <b>groupname:</b> '..msg.to.title..'\n' 
..'ߓŠ<b>Date :</b> '.. os.date('!%A %B:%d:%Y\n', timestamp) 
reply_msg(reply_id, zaza3, ok_cb, false) 
end 
local reply_id = msg ['id'] 
if matches[1]== 'h2' and not is_momod(msg) then 
    local zaza5 = 'مشرفين فقط ߍ秠
    reply_msg(reply_id, zaza5, ok_cb, false) 
    end 
local reply_id = msg ['id'] 
if matches[1]==  'h3' and is_momod(msg) then 
local zaza =[[ 
<b> Hello your orders in the lock and open </b> 
lّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
<b>use</b> (قفل)  ߔ附لقفل 
<b>use</b> (فتح)  ߔ附لفتح 
lـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـl 
ߔ陂فل or فتحߔ蘧لروابط ߃Ϡ
ߔ陂فل or فتحߔ蘬هات الاتصال ߅ﯸϠ
ߔ陂فل or فتحߔ蘧لتكرار ߚ 
ߔ陂فل or فتحߔ蘧لكلايش الطويلة ߓݠ
ߔ陂فل or فتحߔ蘧لعربية ߆Π

ߔ陂فل or فتحߔ蘧لاعضاء ߔҠ
ߔ陂فل or فتحߔ蘧لرتل ߏˠ
ߔ陂فل or فتحߔ蘧لملصقات ߎ�陂فل or فتحߔ蘧لتاك ߀į菠
ߔ陂فل or فتحߔ蘧ليوزرنيم ߌ 
ߔ陂فل or فتحߔ蘧لبوتات ߤ֠
ߔ陂فل or فتحߔ蘧لانكلش ߏ砊ߔ陂فل or فتحߔ蘧عادة توجيه ♻️ 
ߔ陂فل or فتحߔ蘧لصور المتحركةߓ䠊ߔ陂فل or فتحߔ蘧لسمايلات ߚ�陂فل or فتحߔ蘧لصوتيات ߎ䠊ߔ陂فل or فتحߔ蘧لصور ߌǠ
ߔ陂فل or فتحߔ蘧لفيدو ߎ젊ߔ陂فل or فتحߔ蘧لنص ߓѠ
ߔ陂فل or فتحߔ蘧لملفات ߓ 
ߔ陂فل or فتحߔ蘧لدردشة ߚ蠊lـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
߅ﯸϠ#المطور @wounds1 
lـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
 ]] 

..'〰 <b>groupname:</b> '..msg.to.title..'\n' 
..'ߓŠ<b>Date :</b> '.. os.date('!%A %B:%d:%Y\n', timestamp) 
reply_msg(reply_id, zaza, ok_cb, false) 
end 
local reply_id = msg ['id'] 
if matches[1]== 'h3' and not is_momod(msg) then 
    local zaza7 = 'مشرفين فقط ߍ秠
    reply_msg(reply_id, zaza7, ok_cb, false) 
    end 
if matches[1]==  'sudoar' and is_sudo(msg) then 
local zaza2 = [[ 
<b> Hello in your orders sudo </b> 
lـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
ߔ蘪فعيل : ☢لتفعيل البوت 
ߔ蘪عطيل : ♓️ لتعطيل البوت 
ߔ蘪فعيل لمدة :♻️تفعيل بلايام 
ߔ蘧لمدة المتبقية :ߏ瘧لمدة المتبقية 
ߔ蘳وبر : ߚ蘪حويل سوبر 
ߔ蘧رفع المدير : رفع المدير 
ߔ蘭ظر عام :ߔ˙Ę호ر عام 
ߔ虂ائمة العام : ⚙لعرض قائمة العام 
ߔ蘧ذاعة : ߗ㙄لذاعة 
ߔ虅سح المحادثة : ߑљĘ혰ف المحادثة 
ߔ蘷رد الكل : ߑޠلطرد جميه الاعضاء 
ߔ虅علومات : ߑԙŘ附ومات المجموعة
ߔ蘱د + :✅ لضافة رد 
ߔ蘱د - :✔ لحذف الرد 
ߔ蘧لردود :☔ لعرض الردود 
ߔ蘱د حذف الجميع :❎ لحذف الجميع 
lـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
߅ﯸϠ<b>Developer</b> @wounds1 
lـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّـٌّl 
 ]] 
..'〰 <b>groupname:</b> '..msg.to.title..'\n' 
..'ߓŠ<b>Date :</b> '.. os.date('!%A %B:%d:%Y\n', timestamp) 
reply_msg(reply_id, zaza2, ok_cb, false) 
end 
local reply_id = msg ['id'] 
if matches[1]== 'sudoar' and not is_sudo(msg) then 
    local zaza8 = 'بطورين فقط ߍ秠
    reply_msg(reply_id, zaza8, ok_cb, false) 
    end 
end 
return { 
patterns = { 

"^(الاوامر)$", 
"^(h1)$", 
"^(h2)$", 
"^[(h3)$", 
"^(sudoar)$" 
, 
}, 
run = run 
} 
end 
