--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
do

function run(msg, matches)
  return [[ 
  
معلومات المطور 💡

<b> name " mustafa"
 age " 19"
 address" iraq , basrah"
 telegram" iq_100k"
 instagram" 7.fd"
 twitter" almansor98"
 facebook" مصطفى ال منصور "  </b>
 
▫️➖▫️➖▫️➖▫️➖▫️➖▫️

🎗للتحدث مع مطور السورس من هنا 

 🔺™ @iq_100k
 🔻™ @heelp_bot
 
🎗تابع قناه السورس 🏅👇🏻

https://t.me/joinchat/AAAAAEIc8aM_w_dVKTg8Hg
]]
end

return {
  description = "", 
  usage = "!المطور:",
  patterns = {
    "^المطور$"
  }, 
  run = run 
}

end
--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]